---
kind: property
id: P:Autodesk.Revit.DB.ProjectLocationSet.Size
source: html/4b2981a4-37c1-5416-1d44-bd4601e97c44.htm
---
# Autodesk.Revit.DB.ProjectLocationSet.Size Property

Returns the number of project locations that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```